Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: period
fr: période
ko: 마침표
tr: nokta
vi: dấu chấm
zh_hans: 句点
zh_hant: 句點

source: This engine cannot stop a session from TablePro.
fr: Ce moteur ne peut pas arrêter une session de TablePro.
ko: 이 엔진은 TablePro에서 세션을 중지할 수 없습니다.
tr: Bu motor TablePro üzerinden bir oturumu durduramıyor.
vi: Engine này không thể dừng một phiên từ TablePro.
zh_hans: 此引擎无法从 TablePro 停止会话。
zh_hant: 此引擎無法從 TablePro 停止工作階段。

source: Apply to Target…
fr: Postuler à Target...
ko: 대상에 적용…
tr: Hedefe Uygula…
vi: Áp dụng vào đích…
zh_hans: 应用到目标…
zh_hant: 套用到目標…

source: Copy to clipboard
fr: Copier dans le presse-papiers
ko: 클립보드에 복사
tr: Panoya kopyala
vi: Sao chép vào clipboard
zh_hans: 复制到剪贴板
zh_hant: 複製到剪貼簿

source: Copy Node Details
fr: Copier les détails du nœud
ko: 노드 세부사항 복사
tr: Düğüm Ayrıntılarını Kopyala
vi: Sao chép chi tiết nút
zh_hans: 复制节点详情
zh_hant: 複製節點詳細資訊

source: Release the File Lock After (minutes, 0 to keep it)
fr: Débloquez le fichier après (minutes, 0 pour le garder)

source: Clients will appear here while they have an active MCP session.
fr: Les clients apparaîtront ici pendant qu'ils ont une session MCP active.
ko: 활성 MCP 세션이 있는 클라이언트가 여기에 표시됩니다.
tr: Etkin bir MCP oturumu olan istemciler burada görünür.
vi: Các client sẽ hiển thị ở đây khi có phiên MCP đang hoạt động.
zh_hans: 客户端在拥有活跃的MCP会话期间会显示在这里。
zh_hant: 用戶端在擁有作用中的 MCP 工作階段期間會顯示在這裡。

source: Entry %lld
fr: Entrée %lld

source: Human label
fr: Étiquette humaine
ko: 사람이 읽을 레이블
tr: İnsan tarafından okunabilir etiket
vi: Nhãn dễ đọc
zh_hans: 供人阅读的标签
zh_hant: 供人閱讀的標籤

source: Failed to Fetch DDL
fr: Échec de la récupération de la DDL
ko: DDL을 가져오지 못했습니다
tr: DDL Alınamadı
vi: Không thể lấy DDL
zh_hans: 获取 DDL 失败
zh_hant: 擷取 DDL 失敗

source: Add Column…
fr: Ajouter une colonne...
ko: 열 추가…
tr: Sütun Ekle…
vi: Thêm cột…
zh_hans: 添加列…
zh_hant: 新增欄位…

source: Couldn't Save Files
fr: Impossible d'enregistrer les fichiers
ko: 파일을 저장할 수 없음
tr: Dosyalar Kaydedilemedi
vi: Không thể lưu các tệp
zh_hans: 无法保存这些文件
zh_hant: 無法儲存這些檔案

# Query result limit must be between %@ and %@
source: Query result limit must be between %1$@ and %2$@
fr: La limite des résultats de la requête doit être comprise entre %1$@ et %2$@.
ko: 쿼리 결과 제한은 %1$@에서 %2$@ 사이여야 합니다
tr: Sorgu sonuç limiti %@ ile %@ arasında olmalıdır
vi: Giới hạn kết quả truy vấn phải từ %@ đến %@
zh_hans: 查询结果限制必须在 %@ 到 %@ 之间
zh_hant: 查詢結果上限必須介於 %1$@ 到 %2$@ 之間

source: Server-Side Export
fr: Exportation côté serveur

source: Notifications are turned off for TablePro in System Settings.
fr: Les notifications sont désactivées pour TablePro dans les paramètres système.
ko: 시스템 설정에서 TablePro의 알림이 꺼져 있습니다.
tr: Sistem Ayarları'nda TablePro için bildirimler kapalı.
vi: Thông báo cho TablePro đang tắt trong Cài đặt hệ thống.
zh_hans: 在系统设置中，TablePro 的通知已关闭。
zh_hant: 在系統設定中，TablePro 的通知已關閉。

source: history entries
fr: Entrées d'histoire
ko: 기록 항목
vi: mục lịch sử
zh_hans: 条历史记录
zh_hant: 筆歷程記錄

source: In column %@
fr: Dans la colonne %@

source: An external link wants to connect to a %1$@ database: %2$@ Connect only if you trust the source of this link.
fr: Un lien externe veut se connecter à une base de données %1$@ : %2$@ Connectez-vous uniquement si vous faites confiance à la source de ce lien.
ko: 외부 링크에서 %1$@ 데이터베이스에 연결하려고 합니다: %2$@ 이 링크의 출처를 신뢰하는 경우에만 연결하십시오.
tr: Harici bir bağlantı %1$@ veritabanına bağlanmak istiyor: %2$@ Yalnızca bu bağlantının kaynağına güveniyorsanız bağlanın.
vi: Một liên kết bên ngoài muốn kết nối tới cơ sở dữ liệu %1$@: %2$@ Chỉ kết nối nếu bạn tin tưởng nguồn của liên kết này.
zh_hans: 一个外部链接想要连接到 %1$@ 数据库： %2$@ 只有在你信任此链接来源时才连接。
zh_hant: 一個外部連結想要連線到 %1$@ 資料庫： %2$@ 只有在你信任這個連結的來源時才連線。

source: The export file could not be written.
fr: Le fichier d'exportation n'a pas pu être écrit.
ko: 내보내기 파일을 쓸 수 없습니다.
tr: Dışa aktarma dosyası yazılamadı.
vi: Không ghi được tệp xuất.
zh_hans: 无法写入导出文件。
zh_hant: 無法寫入匯出檔案。

source: A table
fr: Une table

source: Answered with 1 tool.
fr: Répondu avec 1 outil.

source: Error: Selected path is not a regular file
fr: Erreur : Le chemin sélectionné n'est pas un fichier régulier.
ko: 오류: 선택한 경로가 일반 파일이 아닙니다
tr: Hata: Seçilen yol normal bir dosya değil
vi: Lỗi: Đường dẫn đã chọn không phải tệp thông thường
zh_hans: 错误: 所选路径不是常规文件
zh_hant: 錯誤：所選路徑不是一般檔案

source: Search Databases
fr: Rechercher dans les bases de données

source: Open Plugin Settings
fr: Ouvrir les paramètres du plugin
ko: 플러그인 설정 열기
tr: Eklenti Ayarlarını Aç
vi: Mở cài đặt plugin
zh_hans: 打开插件设置
zh_hant: 開啟外掛設定

source: Could not save the profile. Check disk space and permissions, then try again.
fr: Impossible d'enregistrer le profil. Vérifiez l'espace disque et les autorisations, puis réessayez.

source: Always Show
fr: Afficher toujours
ko: 항상 표시
tr: Her Zaman Göster
vi: Luôn hiện
zh_hans: 始终显示
zh_hant: 永遠顯示

source: Press %@ and type part of a name to open a table, database, or saved query.
fr: Appuyez sur %@ et tapez une partie d'un nom pour ouvrir une table, une base de données ou une requête enregistrée.
ko: %@을(를) 누르고 이름의 일부를 입력하여 테이블, 데이터베이스 또는 저장된 쿼리를 여세요.
tr: Bir tabloyu, veritabanını veya kayıtlı sorguyu açmak için %@ tuşlarına basın ve adının bir kısmını yazın.
vi: Nhấn %@ và gõ một phần tên để mở bảng, cơ sở dữ liệu hoặc truy vấn đã lưu.
zh_hans: 按 %@ 并输入名称的一部分，即可打开表格、数据库或已保存的查询。
zh_hant: 按 %@ 並輸入名稱的一部分，即可開啟表格、資料庫或已儲存的查詢。

source: Include database schema
fr: Inclure le schéma de la base de
ko: 데이터베이스 스키마 포함
tr: Veritabanı şemasını dahil et
vi: Bao gồm schema cơ sở dữ liệu
zh_hans: 包含数据库 Schema
zh_hant: 包含資料庫綱要

source: System Reserved Shortcut
fr: Accès rapide réservé au système
ko: 시스템 예약 단축키
tr: Sistem Ayrılmış Kısayol
vi: Phím tắt hệ thống
zh_hans: 系统保留快捷键
zh_hant: 系統保留快速鍵

source: %d regions could not be searched.
fr: %d régions n'ont pas pu être recherchées.

source: Open Database…
fr: Ouvrir la base de données...
ko: 데이터베이스 열기…
tr: Veritabanı Aç…
vi: Mở cơ sở dữ liệu…
zh_hans: 打开数据库…
zh_hant: 開啟資料庫…

source: Search text (full-text matched against the query column)
fr: Recherche de texte (texte intégral correspondant à la colonne de requête)
ko: 검색 텍스트(쿼리 열에서 전문 검색으로 일치 항목 찾기)
tr: Arama metni (sorgu sütununda tam metin eşleşmesi yapılır)
vi: Văn bản tìm kiếm (so khớp toàn văn với cột query)
zh_hans: 搜索文本（对 query 列进行全文匹配）
zh_hant: 搜尋文字（對 query 欄位進行全文比對）

source: Checking…
fr: Vérification en cours...

source: Count exactly
fr: Compter exactement
ko: 정확히 계산
tr: Tam say
vi: Đếm chính xác
zh_hans: 精确计数
zh_hant: 精確計算

source: An MCP client
fr: Un client MCP

source: Sort direction:
fr: Direction de tri :
ko: 정렬 방향:
tr: Sıralama yönü:
vi: Hướng sắp xếp:
zh_hans: 排序方向：
zh_hant: 排序方向：

source: List Schemas
fr: Liste des schémas
ko: 스키마 목록
tr: Şemaları Listele
vi: Liệt kê schema
zh_hans: 列出 Schema
zh_hant: 列出綱要

source: Change Password
fr: Changer le mot de passe
ko: 암호 변경
tr: Parolayı Değiştir
vi: Đổi mật khẩu
zh_hans: 更改密码
zh_hant: 更改密碼

source: Switch Failed
fr: Échec du commutateur
ko: 전환 실패
tr: Geçiş Başarısız Oldu
vi: Chuyển thất bại
zh_hans: 切换失败
zh_hant: 切換失敗

# Compare %@ and write changes to %@.
source: Compare %1$@ and write changes to %2$@.
fr: Comparez %1$@ et écrivez les modifications sur %2$@.
ko: %@을(를) 비교하고 변경 사항을 %@에 기록합니다.
tr: %1$@ karşılaştırılır ve değişiklikler %2$@ üzerine yazılır.
vi: So sánh %1$@ và ghi thay đổi vào %2$@.
zh_hans: 比较 %1$@ 并将更改写入 %2$@。
zh_hant: 比較 %1$@ 並將變更寫入 %2$@。

source: Composite Type
fr: Type composite

source: %d values in this column are not in a format the map can read. The grid still shows them as the database returned them.
fr: %d valeurs de cette colonne ne sont pas dans un format que la carte peut lire. La grille les affiche toujours comme elles l'ont retournées par la base de données.

source: A schema with this name already exists.
fr: Un schéma avec ce nom existe déjà.

source: Key column %@ is not present on both sides. Choose a different key.
fr: La colonne clé %@ n'est pas présente des deux côtés. Choisissez une autre clé.
ko: 키 열 %@이(가) 양쪽에 모두 있지는 않습니다. 다른 키를 선택하십시오.
tr: %@ anahtar sütunu iki tarafta da yok. Farklı bir anahtar seçin.
vi: Cột khóa %@ không có ở cả hai bên. Hãy chọn khóa khác.
zh_hans: 键列 %@ 并非双方都有。请选择其他键。
zh_hant: 鍵欄位 %@ 並非雙方都有。請選擇其他鍵。

source: SSH Profiles
fr: Profils SSH
ko: SSH 프로파일
tr: SSH Profilleri
vi: Hồ sơ SSH
zh_hans: SSH 描述文件
zh_hant: SSH 描述檔

source: Restore the previous values of rows you already saved.
fr: Restaurer les valeurs précédentes des lignes que vous avez déjà enregistrées.
ko: 이미 저장한 행의 이전 값을 복원합니다.
tr: Zaten kaydettiğiniz satırların önceki değerlerini geri yükler.
vi: Khôi phục giá trị trước đó của các dòng bạn đã lưu.
zh_hans: 恢复你已经保存的那些行之前的值。
zh_hant: 還原你已經儲存的那些列先前的值。

source: FAVORITES
fr: FAVORIS

source: State
fr: État
ko: 상태
tr: Durum
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

source: Quote identifiers and escape string literals using the connection's own driver rules. Use it before putting any name or value into hand-written SQL.
fr: Utilisez les règles de pilote de la connexion pour citer les identifiants et échapper les caractères de chaîne de caractères. Utilisez-le avant de mettre un nom ou une valeur dans le SQL manuscrit.
ko: 연결 고유의 드라이버 규칙에 따라 식별자를 인용하고 문자열 리터럴을 이스케이프합니다. 손으로 작성한 SQL에 이름이나 값을 넣기 전에 사용하십시오.
tr: Bağlantının kendi sürücü kurallarını kullanarak tanımlayıcıları tırnaklar ve dize değişmez değerlerini kaçışlar. Elle yazılmış SQL'e herhangi bir ad veya değer koymadan önce kullanın.
vi: Trích dẫn định danh và escape các literal chuỗi theo đúng quy tắc driver của kết nối. Hãy dùng nó trước khi đưa bất kỳ tên hay giá trị nào vào SQL viết tay.
zh_hans: 按该连接自己的驱动规则为标识符加引号并转义字符串字面量。在把任何名称或值放进手写 SQL 之前请先使用它。
zh_hant: 按該連線自己的驅動程式規則為識別符號加引號並跳脫字串字面值。在把任何名稱或值放進手寫 SQL 之前請先使用它。

source: Export %d Connections to File…
fr: Exporter %d connexions vers le fichier...
ko: 연결 %d개를 파일로 내보내기…
tr: %d Bağlantıyı Dosyaya Aktar…
vi: Xuất %d kết nối ra tệp…
zh_hans: 导出 %d 个连接到文件…
zh_hant: 匯出 %d 個連線至檔案…

source: This version is no longer available.
fr: Cette version n'est plus disponible.

source: US Short (12/31/2024)
fr: Short américain (31/12/2024)
ko: 미국식 짧은 형식(12/31/2024)
vi: Mỹ ngắn (12/31/2024)
zh_hans: 美式短格式 (12/31/2024)
zh_hant: 美式短格式 (12/31/2024)

source: Context
fr: Contexte
ko: 컨텍스트
tr: Bağlam
vi: Ngữ cảnh
zh_hans: 上下文
zh_hant: 內容脈絡

source: This engine holds %1$lld digits, not %2$lld, so the extra ones are lost.
fr: Ce moteur peut stocker %1$lld chiffres, pas %2$lld, donc les chiffres supplémentaires sont perdus.

source: Comparison Unavailable
fr: Comparaison indisponible
ko: 비교할 수 없음
tr: Karşılaştırma Kullanılamıyor
vi: Không thể so sánh
zh_hans: 无法比较
zh_hant: 無法比較

source: Table structure
fr: Structure de la table

source: Toggle inspector
fr: Changer l'inspecteur
ko: 검사기 표시/숨기기
vi: Bật/tắt thanh kiểm tra
zh_hans: 切换检查器
zh_hant: 切換檢閱器

source: Delete rows the source does not have
fr: Supprimez les lignes que la source n'a pas.
ko: 원본에 없는 행 삭제
tr: Kaynakta olmayan satırları sil
vi: Xóa các dòng mà nguồn không có
zh_hans: 删除来源中没有的行
zh_hant: 刪除來源中沒有的列

source: CLI Connection Name
fr: Nom de la connexion CLI
ko: CLI 연결 이름
tr: CLI bağlantı adı
vi: Tên kết nối CLI
zh_hans: CLI连接名称
zh_hant: CLI 連線名稱

source: Include
fr: Inclure
ko: 포함
tr: Dahil Et
vi: Bao gồm
zh_hans: 包含
zh_hant: 納入

source: question mark
fr: point d'interrogation
ko: 물음표
tr: soru işareti
vi: dấu chấm hỏi
zh_hans: 问号
zh_hant: 問號

source: Event streaming platform
fr: Plateforme de streaming d'événements
ko: 이벤트 스트리밍 플랫폼
tr: Olay akışı platformu
vi: Nền tảng event streaming
zh_hans: 事件流平台
zh_hant: 事件串流平台

source: Value too large to parse
fr: Valeur trop grande pour être analysée
ko: 구문 분석하기에 값이 너무 큽니다
tr: Değer ayrıştırılamayacak kadar büyük
vi: Giá trị quá lớn để phân tích
zh_hans: 值太大，无法解析
zh_hant: 值太大，無法解析

source: Another index is already named %@.
fr: Un autre index est déjà nommé %@.

source: Release the seat on “%@”?
fr: Libérez le siège sur "%@" ?
ko: “%@”의 좌석을 해제하시겠습니까?
tr: “%@” üzerindeki koltuk bırakılsın mı?
vi: Giải phóng chỗ trên “%@”?
zh_hans: 要释放“%@”上的席位吗？
zh_hant: 要釋出「%@」上的席位嗎？

source: Other
fr: Autre
ko: 기타
vi: Khác
zh_hans: 其他
zh_hant: 其他

source: Cancelled before the script finished.
fr: Annulé avant la fin du script.
ko: 스크립트가 끝나기 전에 취소되었습니다.
tr: Betik bitmeden iptal edildi.
vi: Đã hủy trước khi script chạy xong.
zh_hans: 脚本完成前已取消。
zh_hant: 指令稿完成前已取消。

source: Help improve TablePro by sharing anonymous usage statistics (no personal data or queries).
fr: Aidez à améliorer TablePro en partageant des statistiques d'utilisation anonymes (pas de données personnelles ni de requêtes).
ko: 개인 데이터나 쿼리는 제외하고 익명의 사용 통계를 공유하여 TablePro 개선에 도움을 주십시오.
tr: Anonim kullanım istatistiklerini paylaşarak TablePro'nun gelişmesine yardımcı olun (kişisel veri veya sorgu yok).
vi: Giúp cải thiện TablePro bằng cách chia sẻ thống kê sử dụng ẩn danh (không có dữ liệu cá nhân hay truy vấn nào).
zh_hans: 通过分享匿名使用统计数据帮助改进 TablePro（不包含个人数据或查询内容）。
zh_hant: 分享匿名使用統計協助改善 TablePro(不含個人資料或查詢內容)。

source: No schemas
fr: Pas de schémas
ko: 스키마 없음
tr: Şema yok
vi: Không có schema
zh_hans: 没有 Schema
zh_hant: 沒有綱要

source: %lld skipped (no options)
fr: %lld sauté (pas d'options)
ko: %lld개 건너뜀(옵션 없음)
tr: %lld atlandı (no seçenek)
vi: %lld bị bỏ qua (không có tùy chọn)
zh_hans: %lld 已跳过（无选项）
zh_hant: 已略過 %lld 個（無選項）

source: File not found
fr: Fichier non trouvé
ko: 파일을 찾을 수 없음
tr: Dosya bulunamadı
vi: Không tìm thấy tệp
zh_hans: 未找到文件
zh_hant: 找不到檔案

source: Quoted identifiers, in the order supplied
fr: Identifiants cités, dans l'ordre fourni
ko: 제공된 순서대로 인용된 식별자
tr: Verilen sırayla tırnaklanmış tanımlayıcılar
vi: Các định danh đã trích dẫn, theo thứ tự được cung cấp
zh_hans: 已加引号的标识符，按提供的顺序排列
zh_hant: 已加引號的識別符號，按提供的順序排列

source: Requires
fr: Exige
ko: 필요 버전
vi: Yêu cầu
zh_hans: 需要
zh_hant: 需要

source: SASL Mechanism
fr: Mécanisme SASL
ko: SASL 메커니즘
tr: SASL Mekanizması
vi: Cơ chế SASL
zh_hans: SASL 机制
zh_hant: SASL 機制

source: Cloud SQL Instance
fr: Instance Cloud SQL
ko: Cloud SQL 인스턴스
tr: Cloud SQL Örneği
vi: Phiên bản Cloud SQL
zh_hans: Cloud SQL 实例
zh_hant: Cloud SQL 執行個體

source: Auto Generate
fr: Génération automatique
ko: 자동 생성
tr: Otomatik Oluştur
vi: Tự động tạo
zh_hans: 自动生成
zh_hant: 自動產生

source: Something went wrong (error %lld). Try again in a moment.
fr: Quelque chose s'est mal passé (erreur %lld). Réessayez dans un instant.
ko: 문제가 발생했습니다(오류 %lld). 잠시 후 다시 시도하십시오.
tr: Bir sorun oluştu (hata %lld). Biraz sonra tekrar deneyin.
vi: Đã xảy ra lỗi (mã %lld). Vui lòng thử lại sau.
zh_hans: 出现问题（错误 %lld）。请稍后重试。
zh_hant: 發生錯誤（錯誤 %lld）。請稍後再試。

source: AWS SSO
fr: SSO AWS

source: Schema, for a table match
fr: Schéma, pour une correspondance de table
ko: 테이블이 일치할 때의 스키마
tr: Bir tablo eşleşmesi için şema
vi: Schema, khi khớp theo bảng
zh_hans: Schema，用于表匹配
zh_hant: 綱要，用於資料表比對

# %@ on %@ completed successfully.
source: %1$@ on %2$@ completed successfully.
fr: %1$@ sur %2$@ a été terminé avec succès.
ko: %1$@ 작업이 %2$@에서 성공적으로 완료되었습니다.
tr: %@ üzerinde %@ başarıyla tamamlandı.
vi: %@ trên %@ hoàn tất thành công.
zh_hans: %@ 在 %@ 上成功完成。
zh_hant: %1$@ 上的 %2$@ 已成功完成。

source: Index must have a name and at least one column
fr: L'index doit avoir un nom et au moins une colonne.

source: This tab is on %@. Switch the connection to that database to run it.
fr: Cette onglet est sur %@. Changez la connexion à cette base de données pour la lancer.
ko: 이 탭은 %@에 있습니다. 실행하려면 연결을 해당 데이터베이스로 전환하십시오.
tr: Bu sekme %@ üzerinde. Çalıştırmak için bağlantıyı o veritabanına geçirin.
vi: Tab này đang ở %@. Chuyển kết nối sang cơ sở dữ liệu đó để chạy.
zh_hans: 此标签页位于 %@。请将连接切换到该数据库后再运行。
zh_hant: 此分頁位於 %@。請將連線切換到該資料庫後再執行。

source: Add a label at the end
fr: Ajoutez une étiquette à la fin

source: Show details
fr: Afficher les détails
ko: 세부사항 보기
tr: Ayrıntıları göster
vi: Hiện chi tiết
zh_hans: 显示详细信息
zh_hant: 顯示詳細資訊

source: NULL display must be %lld characters or less
fr: L'affichage NULL doit contenir %lld caractères ou moins.
ko: NULL 표시 값은 %lld자 이하여야 합니다
tr: NULL görünümü en fazla %lld karakter olmalı
vi: Hiển thị NULL phải có %lld ký tự trở xuống
zh_hans: NULL 显示不能超过 %lld 个字符
zh_hant: NULL 顯示不能超過 %lld 個字

source: SOCKS proxy disconnected. Click to reconnect.
fr: Le proxy SOCKS est déconnecté. Cliquez pour se reconnecter.
ko: SOCKS 프록시 연결이 끊어졌습니다. 클릭하여 다시 연결하십시오.
tr: SOCKS proxy bağlantısı kesildi. Yeniden bağlanmak için tıklayın.
vi: SOCKS proxy đã ngắt kết nối. Nhấn để kết nối lại.
zh_hans: SOCKS 代理已断开。点按可重新连接。
zh_hant: SOCKS 代理已中斷連線。點按即可重新連線。

# Applied to %@ at %@. %d statements.
source: Applied to %1$@ at %2$@. %3$d statements.
fr: Appliqué à %1$@ à %2$@. Déclarations %3$d.
ko: %2$@에 %1$@(으)로 적용했습니다. 구문 %3$d개.
tr: %2$@ tarihinde %1$@ üzerine uygulandı. %3$d ifade.
vi: Đã áp dụng vào %1$@ lúc %2$@. %3$d câu lệnh.
zh_hans: 已于 %2$@ 应用到 %1$@。共 %3$d 条语句。
zh_hant: 已於 %2$@ 套用到 %1$@。共 %3$d 條陳述式。

source: Export %1$lld rows to %2$@
fr: Exporter %1$lld lignes vers %2$@

source: You have unsaved changes
fr: Vous avez des modifications non enregistrées.
ko: 저장하지 않은 변경 사항이 있습니다
tr: Kaydedilmemiş değişiklikleriniz var
vi: Bạn có thay đổi chưa lưu
zh_hans: 您有未保存的更改
zh_hant: 你有未儲存的變更

source: Token does not have access to this connection
fr: Le jeton n'a pas accès à cette connexion.
ko: 토큰에 이 연결에 대한 접근 권한이 없습니다
tr: Token'ın bu bağlantıya erişimi yok
vi: Token không có quyền truy cập kết nối này
zh_hans: 令牌没有访问此连接的权限
zh_hant: 權杖沒有存取此連線的權限

source: Default row sort:
fr: Traitement par rangée par défaut :
ko: 기본 행 정렬:
tr: Varsayılan satır sıralaması:
vi: Sắp xếp hàng mặc định:
zh_hans: 默认行排序：
zh_hant: 預設的列排序：

source: disconnected
fr: décousu
ko: 연결 해제됨
tr: bağlantı kesildi
vi: đã ngắt kết nối
zh_hans: 已断开连接
zh_hant: 已中斷連線

source: Include current query
fr: Inclure la requête actuelle
ko: 현재 쿼리 포함
tr: Mevcut sorguyu dahil et
vi: Bao gồm truy vấn hiện tại
zh_hans: 包含当前查询
zh_hant: 包含目前查詢

source: Keys are provided by the SSH agent (e.g. 1Password, ssh-agent).
fr: Les clés sont fournies par l'agent SSH (par exemple 1Password, ssh-agent).
ko: 키는 SSH 에이전트(예: 1Password, ssh-agent)에서 제공됩니다.
tr: Anahtarlar SSH aracı tarafından sağlanır (örn. 1Password, ssh-agent).
vi: Khóa được cung cấp bởi SSH agent (ví dụ: 1Password, ssh-agent).
zh_hans: 密钥由 SSH Agent 提供（如 1Password、ssh-agent）。
zh_hant: 金鑰由 SSH Agent 提供(如 1Password、ssh-agent)。

source: Throughput is measured for SSH tunnels and SOCKS proxies, the transports TablePro carries the bytes for itself.
fr: Le débit est mesuré pour les tunnels SSH et les proxys SOCKS, les transports de TablePro transportent les octets pour eux-mêmes.

source: Restart TablePro for the language change to take full effect.
fr: Redémarrez TablePro pour que le changement de langue prenne pleinement effet.
ko: 언어 변경 사항을 완전히 적용하려면 TablePro를 재시작하십시오.
tr: Dil değişikliğinin tam olarak uygulanması için TablePro'yu yeniden başlatın.
vi: Khởi động lại TablePro để thay đổi ngôn ngữ có hiệu lực hoàn toàn.
zh_hans: 重启 TablePro 以使语言更改完全生效。
zh_hant: 重新啟動 TablePro 以讓語言變更完全生效。

source: A save is already running in this window.
fr: Un enregistrement est déjà en cours dans cette fenêtre.
ko: 이 창에서 저장이 이미 실행 중입니다.
tr: Bu pencerede zaten bir kaydetme çalışıyor.
vi: Đã có một thao tác lưu đang chạy trong cửa sổ này.
zh_hans: 此窗口中已有一个保存正在进行。
zh_hant: 此視窗中已有一個儲存正在進行。

source: Hide Connections
fr: Cacher les connexions
ko: 연결 가리기
tr: Bağlantıları Gizle
vi: Ẩn kết nối
zh_hans: 隐藏连接
zh_hant: 隱藏連線

source: Changes applied
fr: Changements appliqués
ko: 변경 사항 적용됨
tr: Değişiklikler uygulandı
vi: Đã áp dụng thay đổi
zh_hans: 更改已应用
zh_hant: 變更已套用

source: Active Queries
fr: Requêtes actives
ko: 활성 쿼리
tr: Aktif Sorgular
vi: Truy vấn đang chạy
zh_hans: 活跃查询
zh_hant: 進行中的查詢

source: Estimated row count
fr: Nombre estimé de lignes
ko: 추정 행 수
tr: Tahmini satır sayısı
vi: Số dòng ước tính
zh_hans: 估算行数
zh_hant: 估算列數

source: Empty string
fr: Chaîne vide

source: Primary Group Name
fr: Nom du groupe primaire
ko: 프라이머리 그룹 이름
tr: Birincil Grup Adı
vi: Tên nhóm primary
zh_hans: 主节点组名称
zh_hant: 主節點群組名稱

source: Deactivate…
fr: Désactiver...
ko: 비활성화…
tr: Devre Dışı Bırak…
vi: Hủy kích hoạt…
zh_hans: 停用…
zh_hant: 停用…

source: User Sessions
fr: Sessions d'utilisateurs
ko: 사용자 세션
tr: Kullanıcı Oturumları
vi: Phiên người dùng
zh_hans: 用户会话
zh_hant: 使用者工作階段

source: A command is required
fr: Un commande est requis

source: Config Host
fr: Hôte de configuration
ko: 구성 호스트
tr: Yapılandırma Sunucusu
vi: Máy chủ cấu hình
zh_hans: 配置主机
zh_hant: 設定主機

source: Opening… %@
fr: Ouverture... %@

source: Collation and character set
fr: Collation et ensemble de caractères
ko: 콜레이션 및 문자 집합
tr: Karşılaştırma ve karakter kümesi
vi: Đối chiếu và bộ ký tự
zh_hans: 排序规则和字符集
zh_hant: 定序和字集

source: Query Insights
fr: Informations sur les requêtes
ko: 쿼리 인사이트
tr: Sorgu Analizleri
vi: Phân tích truy vấn
zh_hans: 查询分析
zh_hant: 查詢分析

# Storage engine differs: %@ on source, %@ on target.
source: Storage engine differs: %1$@ on source, %2$@ on target.
fr: Le moteur de stockage diffère : %1$@ sur la source, %2$@ sur la cible.
ko: 스토리지 엔진이 다릅니다. 원본은 %@, 대상은 %@입니다.
tr: Depolama motoru farklı: kaynakta %1$@, hedefte %2$@.
vi: Storage engine khác nhau: %1$@ ở nguồn, %2$@ ở đích.
zh_hans: 存储引擎不同：来源为 %1$@，目标为 %2$@。
zh_hant: 儲存引擎不同：來源為 %1$@，目標為 %2$@。

source: Close result tab
fr: Fermer l'onglet des résultats
ko: 결과 탭 닫기
tr: Sonuç sekmesini kapat
vi: Đóng tab kết quả
zh_hans: 关闭结果标签页
zh_hant: 關閉結果分頁

source: Not a full path. Use a path that starts with / or ~.
fr: Pas un chemin complet. Utilisez un chemin qui commence par / ou ~.

source: Updating…
fr: Mise à jour en cours...
ko: 업데이트 중…
tr: Güncelleniyor…
vi: Đang cập nhật…
zh_hans: 正在更新…
zh_hant: 正在更新…

source: Cannot format empty SQL
fr: Impossible de formater SQL vide
ko: 빈 SQL은 포맷할 수 없습니다
tr: Boş SQL biçimlendirilemez
vi: Không thể định dạng SQL trống
zh_hans: 无法格式化空 SQL
zh_hant: 無法格式化空白的 SQL

source: No SSH agent answered on the socket from %@. Check that agent is running.
fr: Aucun agent SSH n'a répondu sur le socket de %@. Vérifiez que cet agent est en cours d'exécution.

source: Show Sidebar
fr: Afficher la barre latérale
ko: 사이드바 보기
tr: Kenar Çubuğunu Göster
vi: Hiện thanh bên
zh_hans: 显示侧边栏
zh_hant: 顯示側邊欄

source: any element
fr: Tout élément
ko: 임의 요소
tr: herhangi bir öğe
vi: phần tử bất kỳ
zh_hans: 任一元素
zh_hant: 任一元素

source: Counting…
fr: En comptant...
ko: 계산 중…
tr: Sayılıyor…
vi: Đang đếm…
zh_hans: 统计中…
zh_hant: 計算中…

source: Transaction Control
fr: Contrôle de la transaction
ko: 트랜잭션 제어
tr: İşlem Denetimi
vi: Điều khiển transaction
zh_hans: 事务控制
zh_hant: 交易控制

source: The AWS credentials for this profile have expired. Sign in again and retry.
fr: Les identifiants AWS pour ce profil ont expiré. Connectez-vous à nouveau et réessayez.

source: Quote every field name. An ObjectId is {"$oid": "…"} and a date is {"$date": "…"}.
fr: Citez chaque nom de champ entre guillemets. Un ObjectId est {"$oid": "…"} et une date est {"$date": "…"}.

source: No tabs open
fr: Aucune onglet ouvert
ko: 열려 있는 탭 없음
tr: Açık sekme yok
vi: Không có tab nào mở
zh_hans: 没有打开的标签页
zh_hant: 沒有開啟的分頁

source: Duplicate Database…
fr: Base de données en double...

source: External client access level
fr: Niveau d'accès client externe
ko: 외부 클라이언트 접근 수준
tr: Dış istemci erişim düzeyi
vi: Mức truy cập cho client bên ngoài
zh_hans: 外部客户端访问级别
zh_hant: 外部用戶端存取層級

source: Encoded as %@. Saving keeps this encoding, and a character it can't represent stops the save.
fr: Encodé en %@. Le sauvegarde conserve cette encodage, et un caractère qu'il ne peut pas représenter arrête le sauvegarde.
ko: %@(으)로 인코딩됨. 저장해도 이 인코딩이 유지되며, 표현할 수 없는 문자가 있으면 저장이 중단됩니다.
tr: %@ ile kodlanmış. Kaydetme bu kodlamayı korur; gösterilemeyen bir karakter kaydetmeyi durdurur.
vi: Mã hoá %@. Khi lưu, mã hoá này được giữ nguyên, và ký tự không biểu diễn được sẽ khiến việc lưu dừng lại.
zh_hans: 编码为 %@。存储时保留此编码，遇到无法表示的字符时会停止存储。
zh_hant: 編碼為 %@。儲存時保留此編碼，遇到無法表示的字元時會停止儲存。
